In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9])
s

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [3]:
dates = pd.date_range("20130101", periods=6)
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01  0.238745  0.417412  0.488338 -1.175805
2013-01-02  0.382514  0.165031  0.378880 -0.642920
2013-01-03  1.023717  0.687466  0.292828  1.313113
2013-01-04 -0.796372  1.405857  0.180699  0.208169
2013-01-05  0.600263 -1.027984  0.311227 -0.852851
2013-01-06  1.272418  0.463454  2.107792  2.064602

In [5]:
a = np.random.randn(6, 4)
a

array([[-0.36486968,  0.48557699,  1.52391401, -0.26736099],
       [-2.02152971,  1.97604302,  0.4392224 , -1.44251097],
       [-0.35422317, -0.09551903, -0.02269937,  1.16684967],
       [-0.07168912,  1.94588817, -0.54096386,  0.36187285],
       [ 1.4930894 ,  1.07692333,  0.4994377 , -1.42936138],
       [-0.60536615,  0.54145526, -0.09739706,  2.07281979]])

In [6]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [8]:
df.head()

                   A         B         C         D
2013-01-01  0.238745  0.417412  0.488338 -1.175805
2013-01-02  0.382514  0.165031  0.378880 -0.642920
2013-01-03  1.023717  0.687466  0.292828  1.313113
2013-01-04 -0.796372  1.405857  0.180699  0.208169
2013-01-05  0.600263 -1.027984  0.311227 -0.852851

In [9]:
df.tail()

                   A         B         C         D
2013-01-02  0.382514  0.165031  0.378880 -0.642920
2013-01-03  1.023717  0.687466  0.292828  1.313113
2013-01-04 -0.796372  1.405857  0.180699  0.208169
2013-01-05  0.600263 -1.027984  0.311227 -0.852851
2013-01-06  1.272418  0.463454  2.107792  2.064602

In [10]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [11]:
df.to_numpy

<bound method DataFrame.to_numpy of                    A         B         C         D
2013-01-01  0.238745  0.417412  0.488338 -1.175805
2013-01-02  0.382514  0.165031  0.378880 -0.642920
2013-01-03  1.023717  0.687466  0.292828  1.313113
2013-01-04 -0.796372  1.405857  0.180699  0.208169
2013-01-05  0.600263 -1.027984  0.311227 -0.852851
2013-01-06  1.272418  0.463454  2.107792  2.064602>

In [12]:
df

                   A         B         C         D
2013-01-01  0.238745  0.417412  0.488338 -1.175805
2013-01-02  0.382514  0.165031  0.378880 -0.642920
2013-01-03  1.023717  0.687466  0.292828  1.313113
2013-01-04 -0.796372  1.405857  0.180699  0.208169
2013-01-05  0.600263 -1.027984  0.311227 -0.852851
2013-01-06  1.272418  0.463454  2.107792  2.064602

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.238745    0.382514    1.023717   -0.796372    0.600263    1.272418
B    0.417412    0.165031    0.687466    1.405857   -1.027984    0.463454
C    0.488338    0.378880    0.292828    0.180699    0.311227    2.107792
D   -1.175805   -0.642920    1.313113    0.208169   -0.852851    2.064602

In [14]:
df

                   A         B         C         D
2013-01-01  0.238745  0.417412  0.488338 -1.175805
2013-01-02  0.382514  0.165031  0.378880 -0.642920
2013-01-03  1.023717  0.687466  0.292828  1.313113
2013-01-04 -0.796372  1.405857  0.180699  0.208169
2013-01-05  0.600263 -1.027984  0.311227 -0.852851
2013-01-06  1.272418  0.463454  2.107792  2.064602

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.453548  0.351873  0.626627  0.152385
std    0.725348  0.797391  0.732680  1.297233
min   -0.796372 -1.027984  0.180699 -1.175805
25%    0.274687  0.228126  0.297428 -0.800368
50%    0.491389  0.440433  0.345053 -0.217376
75%    0.917854  0.631463  0.460974  1.036877
max    1.272418  1.405857  2.107792  2.064602

In [16]:
df.sort_index(axis=0,ascending=False)

                   A         B         C         D
2013-01-06  1.272418  0.463454  2.107792  2.064602
2013-01-05  0.600263 -1.027984  0.311227 -0.852851
2013-01-04 -0.796372  1.405857  0.180699  0.208169
2013-01-03  1.023717  0.687466  0.292828  1.313113
2013-01-02  0.382514  0.165031  0.378880 -0.642920
2013-01-01  0.238745  0.417412  0.488338 -1.175805

In [17]:
df.sort_values(by="B",ascending=False)

                   A         B         C         D
2013-01-04 -0.796372  1.405857  0.180699  0.208169
2013-01-03  1.023717  0.687466  0.292828  1.313113
2013-01-06  1.272418  0.463454  2.107792  2.064602
2013-01-01  0.238745  0.417412  0.488338 -1.175805
2013-01-02  0.382514  0.165031  0.378880 -0.642920
2013-01-05  0.600263 -1.027984  0.311227 -0.852851

In [18]:
df2.loc[1:3,["A","B"]]

     A          B
1  1.0 2013-01-02
2  1.0 2013-01-02
3  1.0 2013-01-02

In [19]:
df.loc["2013-01-01", ["A"]]

A    0.238745
Name: 2013-01-01 00:00:00, dtype: float64

In [20]:
df.iloc[0:3,2:4]

                   C         D
2013-01-01  0.488338 -1.175805
2013-01-02  0.378880 -0.642920
2013-01-03  0.292828  1.313113

In [21]:
df[df["A"]>1]

                   A         B         C         D
2013-01-03  1.023717  0.687466  0.292828  1.313113
2013-01-06  1.272418  0.463454  2.107792  2.064602

In [22]:
df = df.iloc[0:6,:]

In [23]:
df

                   A         B         C         D
2013-01-01  0.238745  0.417412  0.488338 -1.175805
2013-01-02  0.382514  0.165031  0.378880 -0.642920
2013-01-03  1.023717  0.687466  0.292828  1.313113
2013-01-04 -0.796372  1.405857  0.180699  0.208169
2013-01-05  0.600263 -1.027984  0.311227 -0.852851
2013-01-06  1.272418  0.463454  2.107792  2.064602

In [24]:
df["E"] = ["one","two","three","four","five","six"]

/var/folders/6x/wgh739ls5z333f70z53v36600000gn/T/ipykernel_4729/319696895.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["E"] = ["one","two","three","four","five","six"]

In [25]:
df

                   A         B         C         D      E
2013-01-01  0.238745  0.417412  0.488338 -1.175805    one
2013-01-02  0.382514  0.165031  0.378880 -0.642920    two
2013-01-03  1.023717  0.687466  0.292828  1.313113  three
2013-01-04 -0.796372  1.405857  0.180699  0.208169   four
2013-01-05  0.600263 -1.027984  0.311227 -0.852851   five
2013-01-06  1.272418  0.463454  2.107792  2.064602    six

In [26]:
df[df["E"].isin(["one","two","three"])]

                   A         B         C         D      E
2013-01-01  0.238745  0.417412  0.488338 -1.175805    one
2013-01-02  0.382514  0.165031  0.378880 -0.642920    two
2013-01-03  1.023717  0.687466  0.292828  1.313113  three

In [27]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [28]:
df.at[dates[0], "A"] = 0

In [29]:
df

                   A         B         C         D      E
2013-01-01  0.000000  0.417412  0.488338 -1.175805    one
2013-01-02  0.382514  0.165031  0.378880 -0.642920    two
2013-01-03  1.023717  0.687466  0.292828  1.313113  three
2013-01-04 -0.796372  1.405857  0.180699  0.208169   four
2013-01-05  0.600263 -1.027984  0.311227 -0.852851   five
2013-01-06  1.272418  0.463454  2.107792  2.064602    six

In [30]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [31]:
df1.loc[dates[0] : dates[1], "E"] = None

In [32]:
df1

                   A         B         C         D      E      E
2013-01-01  0.000000  0.417412  0.488338 -1.175805   None   None
2013-01-02  0.382514  0.165031  0.378880 -0.642920   None   None
2013-01-03  1.023717  0.687466  0.292828  1.313113  three  three
2013-01-04 -0.796372  1.405857  0.180699  0.208169   four   four

In [33]:
df1.isna()

                A      B      C      D      E      E
2013-01-01  False  False  False  False   True   True
2013-01-02  False  False  False  False   True   True
2013-01-03  False  False  False  False  False  False
2013-01-04  False  False  False  False  False  False

In [34]:
df1.dropna(how="any")

                   A         B         C         D      E      E
2013-01-03  1.023717  0.687466  0.292828  1.313113  three  three
2013-01-04 -0.796372  1.405857  0.180699  0.208169   four   four

In [35]:
df1.fillna(value=10000)

                   A         B         C         D      E      E
2013-01-01  0.000000  0.417412  0.488338 -1.175805  10000  10000
2013-01-02  0.382514  0.165031  0.378880 -0.642920  10000  10000
2013-01-03  1.023717  0.687466  0.292828  1.313113  three  three
2013-01-04 -0.796372  1.405857  0.180699  0.208169   four   four

In [38]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [39]:
df1

                   A         B         C         D      E      E
2013-01-01  0.000000  0.417412  0.488338 -1.175805    one    one
2013-01-02  0.382514  0.165031  0.378880 -0.642920    two    two
2013-01-03  1.023717  0.687466  0.292828  1.313113  three  three
2013-01-04 -0.796372  1.405857  0.180699  0.208169   four   four

In [42]:
df1 = df1.loc[:,["A","B","C","D"]]

In [43]:
df1

                   A         B         C         D
2013-01-01  0.000000  0.417412  0.488338 -1.175805
2013-01-02  0.382514  0.165031  0.378880 -0.642920
2013-01-03  1.023717  0.687466  0.292828  1.313113
2013-01-04 -0.796372  1.405857  0.180699  0.208169

In [44]:
df1.sum()

A    0.609860
B    2.675766
C    1.340745
D   -0.297444
dtype: float64

In [45]:
df1.mean()

A    0.152465
B    0.668941
C    0.335186
D   -0.074361
dtype: float64

In [46]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates)

In [47]:
s

2013-01-01    1.0
2013-01-02    3.0
2013-01-03    5.0
2013-01-04    NaN
2013-01-05    6.0
2013-01-06    8.0
Freq: D, dtype: float64

In [48]:
s.shift(2)

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [49]:
s.shift(3)

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    NaN
2013-01-04    1.0
2013-01-05    3.0
2013-01-06    5.0
Freq: D, dtype: float64

In [57]:
df = df[["A","B","C","D"]]
df

                   A         B         C         D
2013-01-01  0.000000  0.417412  0.488338 -1.175805
2013-01-02  0.382514  0.165031  0.378880 -0.642920
2013-01-03  1.023717  0.687466  0.292828  1.313113
2013-01-04 -0.796372  1.405857  0.180699  0.208169
2013-01-05  0.600263 -1.027984  0.311227 -0.852851
2013-01-06  1.272418  0.463454  2.107792  2.064602

In [56]:
df.agg(lambda x: np.mean(x))

A    0.413757
B    0.351873
C    0.626627
D    0.152385
dtype: float64

In [68]:
df.agg(lambda x : np.mean(x))

A    0.413757
B    0.351873
C    0.626627
D    0.152385
dtype: float64

In [74]:
df[["A","B"]].value_counts()

A          B
-0.796372   1.405857    1
 0.000000   0.417412    1
 0.382514   0.165031    1
 0.600263  -1.027984    1
 1.023717   0.687466    1
 1.272418   0.463454    1
Name: count, dtype: int64

In [75]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

In [76]:
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [77]:
s.str.

0    1.0
1    1.0
2    1.0
3    4.0
4    4.0
5    NaN
6    4.0
7    3.0
8    3.0
dtype: float64

In [78]:
df = pd.DataFrame(np.random.randn(10, 4))

In [79]:
df

          0         1         2         3
0 -0.450817  0.419166 -0.939975 -0.846785
1 -0.658088  0.469339  0.018188 -0.863995
2  0.955883 -0.603263 -1.998166 -1.545964
3 -0.018914  0.983932 -0.544910 -1.172312
4 -0.929846  0.905355 -1.266562 -0.524325
5 -0.930754  0.491491 -0.160189  0.010583
6 -1.214463 -0.497241 -0.520908  0.014909
7  1.833615  1.729810  0.665569  0.413281
8  0.832183  0.774555  0.716293 -1.326277
9  0.996099  1.420358 -0.429456 -2.124392

In [96]:

pd.DataFrame(np.random.randn(10,4))

          0         1         2         3
0  0.110999 -0.392028 -0.334200  0.136339
1 -1.356378 -2.259095 -1.465765 -0.587902
2  0.275334  0.443361  0.652618 -0.347076
3 -0.306522 -0.732027  0.276121 -1.217996
4 -0.023526  1.399341  0.170798  0.011178
5  0.074972 -0.032239  0.292169 -1.256011
6 -1.555464 -0.413649  0.220468  0.926700
7 -0.556913 -0.761473  0.869643  1.328789
8  0.381433 -0.906072  1.420300 -2.063132
9  0.244135 -1.645033 -0.044988  0.292289

In [97]:
pieces = [df[:3], df[3:7], df[7:]]

In [98]:
pieces

[          0         1         2         3
 0 -0.450817  0.419166 -0.939975 -0.846785
 1 -0.658088  0.469339  0.018188 -0.863995
 2  0.955883 -0.603263 -1.998166 -1.545964,
           0         1         2         3
 3 -0.018914  0.983932 -0.544910 -1.172312
 4 -0.929846  0.905355 -1.266562 -0.524325
 5 -0.930754  0.491491 -0.160189  0.010583
 6 -1.214463 -0.497241 -0.520908  0.014909,
           0         1         2         3
 7  1.833615  1.729810  0.665569  0.413281
 8  0.832183  0.774555  0.716293 -1.326277
 9  0.996099  1.420358 -0.429456 -2.124392]

In [99]:
pd.concat([pieces[0],pieces[1],pieces[2]])

          0         1         2         3
0 -0.450817  0.419166 -0.939975 -0.846785
1 -0.658088  0.469339  0.018188 -0.863995
2  0.955883 -0.603263 -1.998166 -1.545964
3 -0.018914  0.983932 -0.544910 -1.172312
4 -0.929846  0.905355 -1.266562 -0.524325
5 -0.930754  0.491491 -0.160189  0.010583
6 -1.214463 -0.497241 -0.520908  0.014909
7  1.833615  1.729810  0.665569  0.413281
8  0.832183  0.774555  0.716293 -1.326277
9  0.996099  1.420358 -0.429456 -2.124392

In [100]:
df = pd.DataFrame(
     {
         "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
         "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
         "C": np.random.randn(8),
         "D": np.random.randn(8),
     }
 )

In [110]:
df

     A      B         C         D
0  foo    one -0.149097  0.755888
1  bar    one -1.876036  0.309398
2  foo    two -0.296587 -1.724427
3  bar  three  0.060922  1.434316
4  foo    two  0.447999 -1.951953
5  bar    two  0.580717  0.803802
6  foo    one -0.379133  1.268831
7  foo  three -0.908519 -0.252273

In [108]:
df.groupby("A")[["C","D"]].sum()

            C         D
A
bar -1.234397  2.547516
foo -1.285337 -1.903934

In [112]:
df.groupby(["A","B"])[["C","D"]].sum()

                  C         D
A   B
bar one   -1.876036  0.309398
    three  0.060922  1.434316
    two    0.580717  0.803802
foo one   -0.528231  2.024718
    three -0.908519 -0.252273
    two    0.151412 -3.676380

In [113]:
arrays = [
   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]

In [114]:
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])

In [115]:
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [116]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

In [118]:
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.634289 -0.826334
      two     0.461808 -1.452569
baz   one     1.764279 -0.899099
      two    -0.681655 -0.227775

In [122]:
stacked = df2.stack(future_stack=True)
stacked

first  second
bar    one     A   -0.634289
               B   -0.826334
       two     A    0.461808
               B   -1.452569
baz    one     A    1.764279
               B   -0.899099
       two     A   -0.681655
               B   -0.227775
dtype: float64

In [123]:
stacked.unstack()

                     A         B
first second
bar   one    -0.634289 -0.826334
      two     0.461808 -1.452569
baz   one     1.764279 -0.899099
      two    -0.681655 -0.227775

In [126]:
stacked.unstack(2)

                     A         B
first second
bar   one    -0.634289 -0.826334
      two     0.461808 -1.452569
baz   one     1.764279 -0.899099
      two    -0.681655 -0.227775

In [127]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

In [128]:
df

        A  B    C         D         E
0     one  A  foo  1.328636  0.851628
1     one  B  foo -0.379766 -0.710549
2     two  C  foo  1.114152 -1.510121
3   three  A  bar  2.366064  0.243819
4     one  B  bar -0.751597  1.020764
5     one  C  bar  0.488517 -0.637025
6     two  A  foo -0.105202  0.596793
7   three  B  foo -0.543058  1.214741
8     one  C  foo -1.094177 -0.237440
9     one  A  bar -0.171064 -0.026915
10    two  B  bar  0.863314 -1.075782
11  three  C  bar  0.312725 -0.872490

In [133]:
pd.pivot_table(df,values="D",index=["A","B"],columns=["C"])

C             bar       foo
A     B
one   A -0.171064  1.328636
      B -0.751597 -0.379766
      C  0.488517 -1.094177
three A  2.366064       NaN
      B       NaN -0.543058
      C  0.312725       NaN
two   A       NaN -0.105202
      B  0.863314       NaN
      C       NaN  1.114152

In [144]:
rng = pd.date_range("1/1/2012", periods=100, freq="s")
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [145]:
ts

2012-01-01 00:00:00    422
2012-01-01 00:00:01    126
2012-01-01 00:00:02    206
2012-01-01 00:00:03    201
2012-01-01 00:00:04    118
                      ...
2012-01-01 00:01:35    335
2012-01-01 00:01:36     92
2012-01-01 00:01:37    201
2012-01-01 00:01:38    412
2012-01-01 00:01:39     16
Freq: s, Length: 100, dtype: int64

In [146]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)

In [150]:
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e